load-tester/test-50.yml
config:
  target: "http://localhost:4001"
  processor: "./processor.js"
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Load 50 users (5 users per sec for 10 sec)"
  engines:
    socketio-v3: {}

scenarios:
  - name: "User connects, sends a message"
    engine: "socketio-v3"
    flow:
      - function: "generateAuth"
      - connect:
          auth:
            token: "{{ token }}"
      - emit:
          channel: "send_message"
          data:
            senderId: "{{ senderId }}"
            receiverId: "{{ receiverId }}"
            message: "Hello from user {{ senderId }} to {{ receiverId }}!"
            clientTimestamp: 1718881234
      - think: 5