load-tester/test-500.yml
config:
  target: "http://localhost:4001"
  processor: "./processor.js"
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: "Load 500 users over 30 sec"
  engines:
    socketio-v3: {}

scenarios:
  - name: "User connects, sends a message"
    engine: "socketio-v3"
    flow:
      - function: "generateAuth"
      - connect:
          auth:
            token: "{{ token }}"
      - emit:
          channel: "send_message"
          data:
            senderId: "{{ senderId }}"
            receiverId: "{{ receiverId }}"
            message: "Hello from user {{ senderId }} to {{ receiverId }}!"
            clientTimestamp: 1718881234
      - think: 10